src/Catalogs/рнсКлючиОбщихНастроек/рнсКлючиОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсКлючиОбщихНастроек</name>
  <owners>Catalog.рнсРазделыОбщихНастроек</owners>
  <tabularSections>
    <name>ЗначенияКлюча</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсКлючиОбщихНастроек/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Раздел = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И (НЕ Параметры.ЗначенияЗаполнения.Свойство("Владелец", Раздел) ИЛИ НЕ ЗначениеЗаполнено(Раздел)) Тогда
		Отказ = Истина; 	
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		рнсОбщегоНазначения.ИнициализироватьПМФ(ЭтотОбъект, ДополнительныеПоляТаблицыКомпонентов()); 	
		ДобавитьРеквизитыПолейКлюча();	
	КонецЕсли; 
	
	СоздатьЭлементы();
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	рнсОбщегоНазначения.ИнициализироватьПМФ(ЭтотОбъект, ДополнительныеПоляТаблицыКомпонентов());
	ДобавитьРеквизитыПолейКлюча(); 
	ЗаполнитьПоляКлюча();
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЗначенияКлюча.Очистить();	
	
	СписокПолей = Новый СписокЗначений;
	СписокКомпонентов = рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "Основной", 0);
	
	Для каждого Ит Из СписокКомпонентов Цикл
		СписокПолей.Добавить(ЭтотОбъект[Ит.ИмяКомпонента], Ит.НомерПоПорядку);
		ТекущийОбъект.ЗначенияКлюча.Добавить();
	КонецЦикла;
	
	СписокПолей.СортироватьПоПредставлению(НаправлениеСортировки.Возр);  
	ТекущийОбъект.ЗначенияКлюча.ЗагрузитьКолонку(СписокПолей.ВыгрузитьЗначения(), "Значение");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриИзменеииЗначенияПоляКлюча(Элементы)
	ПриИзменеииЗначенияПоляКлючаНаСервере();			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзменеииЗначенияПоляКлючаНаСервере()
	
	Наименование		= "";	
	СписокКомпонентов 	= рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "Основной", 0);
	
	Для каждого Ит Из СписокКомпонентов Цикл  
		Наименование = Наименование + ЭтотОбъект[Ит.ИмяКомпонента] + ";";	
	КонецЦикла; 
	
	Объект.Наименование = Наименование;
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьЭлементы() 	
	
	СвойстваПоля		= Новый Структура("Имя, Вид, Действия", "", ВидПоляФормы.ПолеВвода, Новый Структура("ПриИзменении", "ПриИзменеииЗначенияПоляКлюча"));
	РодительПоУмолчанию = Элементы.ГруппаЗначенияПолейКлюча;
	СписокКомпоненов 	= рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "Основной", 0);
	
	Для каждого Ит Из СписокКомпоненов Цикл  
		
		СвойстваПоля.Имя 	= Ит.ИмяКомпонента;	
		НовыйЭлемент 		= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, СвойстваПоля, Тип("ПолеФормы"), РодительПоУмолчанию); 
		
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "Основной", НовыйЭлемент, 1);	
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ДополнительныеПоляТаблицыКомпонентов()
	
	Результат = Новый Структура; 
	Результат.Вставить("НомерПоПорядку", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьРеквизитыПолейКлюча()
	
	Если ЗначениеЗаполнено(ЭтотОбъект["КомпонентыПМФ"]) Тогда
		Возврат;	
	КонецЕсли; 
	
	МассивРеквизитов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Заголовок КАК Заголовок,
		|	Таблица.НомерСтроки КАК НомерПоПорядку,
		|	Таблица.ПолеКлюча.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек.НастройкаКлюча КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Раздел";
	
	Запрос.УстановитьПараметр("Раздел", Объект.Владелец);
	
	РезультатЗапроса 		= Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		ИмяРеквизита 	= "ПолеКлюча" + ВыборкаДетальныеЗаписи.НомерПоПорядку;
		НовыйРеквизит 	= Новый РеквизитФормы(ИмяРеквизита, ВыборкаДетальныеЗаписи.ТипЗначения,, ВыборкаДетальныеЗаписи.Заголовок); 
				
		МассивРеквизитов.Добавить(НовыйРеквизит);  
		
		НоваяСтрока 				= рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "Основной", НовыйРеквизит, 0);
		НоваяСтрока.НомерПоПорядку 	= ВыборкаДетальныеЗаписи.НомерПоПорядку;
		
	КонецЦикла;	
	
	ИзменитьРеквизиты(МассивРеквизитов);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляКлюча()
	
	СписокКомпоненов = рнсОбщегоНазначения.КомпонентыРаздела(ЭтотОбъект, "Основной", 0);
	
	Для каждого Ит Из СписокКомпоненов Цикл
		
		Если Объект.ЗначенияКлюча.Количество() >= Ит.НомерПоПорядку Тогда
			ЭтотОбъект[Ит.ИмяКомпонента] = Объект.ЗначенияКлюча[Ит.НомерПоПорядку - 1].Значение;
		Иначе
			ЭтотОбъект[Ит.ИмяКомпонента] = Неопределено;	
		КонецЕсли;  		
		
	КонецЦикла;	
	
КонецПроцедуры 

#КонецОбласти
